<?php

return [
    /*
    |--------------------------------------------------------------------------
    | أسطر تذكير كلمة المرور
    |--------------------------------------------------------------------------
    |
    | الأسطر التالية هي الرسائل الافتراضية التي تظهر عند فشل محاولة تحديث كلمة المرور
    | لأسباب مثل رمز غير صالح أو كلمة مرور جديدة غير مقبولة.
    |
    */

    'password' => 'يجب أن تتكون كلمة المرور من 6 أحرف على الأقل وتطابق حقل التأكيد.',
    'reset' => 'تم إعادة تعيين كلمة المرور بنجاح!',
    'sent' => 'تم إرسال رابط إعادة تعيين كلمة المرور إلى بريدك الإلكتروني!',
    'token' => 'رابط إعادة التعيين غير صالح أو منتهي الصلاحية.',
    'user' => 'لا يوجد حساب مرتبط بهذا البريد الإلكتروني.',
];