<?php

return [
    // العناوين الرئيسية
    'units' => 'الوحدات',
    'manage_your_units' => 'إدارة الوحدات',
    'all_your_units' => 'جميع الوحدات',
    
    // حقول البيانات
    'name' => 'اسم الوحدة',
    'short_name' => 'الاختصار',
    'allow_decimal' => 'السماح بالكسور العشرية',
    
    // رسائل النظام
    'added_success' => 'تم إضافة الوحدة بنجاح',
    'updated_success' => 'تم تحديث الوحدة بنجاح',
    'deleted_success' => 'تم حذف الوحدة بنجاح',
    
    // إجراءات
    'add_unit' => 'إضافة وحدة جديدة',
    'edit_unit' => 'تعديل الوحدة',
];