<?php

return [
    // إعدادات الملف الشخصي
    'edit_profile' => 'تعديل الملف الشخصي',
    'change_password' => 'تغيير كلمة المرور',
    'current_password' => 'كلمة المرور الحالية',
    'new_password' => 'كلمة مرور جديدة',
    'confirm_new_password' => 'تأكيد كلمة المرور الجديدة',

    // إدارة المستخدمين
    'user_management' => 'إدارة المستخدمين',
    'users' => 'المستخدمون',
    'manage_users' => 'إدارة المستخدمين',
    'all_users' => 'جميع المستخدمين',
    'add_user' => 'إضافة مستخدم',
    'name' => 'الاسم',
    'role' => 'الدور',
    'user_added' => 'تم إضافة المستخدم بنجاح',
    'edit_user' => 'تعديل بيانات المستخدم',
    'leave_password_blank' => 'اترك حقل كلمة المرور فارغاً إذا كنت لا ترغب في تحديثها',
    'user_update_success' => 'تم تحديث بيانات المستخدم بنجاح',
    'user_delete_success' => 'تم حذف المستخدم بنجاح',

    // إدارة الأدوار والصلاحيات
    'roles' => 'الأدوار',
    'manage_roles' => 'إدارة الأدوار',
    'all_roles' => 'كافة الأدوار',
    'add_role' => 'إضافة دور جديد',
    'role_name' => 'اسم الدور',
    'permissions' => 'الصلاحيات',
    'role_added' => 'تم إضافة الدور بنجاح',
    'role_already_exists' => 'هذا الدور موجود بالفعل',
    'edit_role' => 'تعديل الدور',
    'role_updated' => 'تم تحديث الدور بنجاح',
    'role_deleted' => 'تم حذف الدور بنجاح',
    'role_is_default' => 'لا يمكن تعديل هذا الدور (افتراضي)',
];